{
  "title": "你好",
  "message": "欢迎来到我的网站!",
  "Introduction": "介绍",
  "uploadTips": "只可以上传txt类型的文件并且文本的大小不能超过5MB",
  "iterationTimes": "迭代次数",
  "originLanguage": "初始语言",
  "targetLanguage": "目标语言",
  "failtouploadTips": "你需要先改变迭代次数",
  "Cancel": "取消",
  "originContent": "初始文本内容",
  "targetContent": "输出文本内容",
  "Home": "主页",
  "Academic": "学术",
  "Translate": "翻译",
  "Polynomial": "多项式",
  "Regression": "回归",
  "The main purpose of this function is to reduce academic weight.The main way is to read the final translated file into the target language by passing in a local txt file.\nThe method of this function is to set the local language as the automatic language by default,convert German,thenconvert to Chinese,and finally convert to the targetlanguage.This is a cycle.\nThe Baidu translation and Alibaba Cloud translation api are used to alternate repeatedly to achieve the effect ofconfusion.This function provides multiple cycles,up to 20 times,which further reduces the repetition rate of input and output content.\nTips:Please adjust the iterations times online beforeuploading the file for the first time,because the defaultvalue of this function is 1,which may not achieve the desired effect.": "此功能的主要目的是通过传递本地txt文件以读取最终翻译文件作为目标语言来降低学术权重。该函数的方法是将本地语言默认转换为自动语言，然后转换为中文，最后转换为目标语言，这是一个循环。百度翻译和阿里翻译提供多次循环，最多20次(非会员只有十次)，进一步降低了输入输出内容的重复率提醒: 请在第一次上传文件前在线调整迭代次数，此功能默认值为1，这可能不会达到预期的效果",
  "Polynomial regression is designed to process a CSV file, its function is to read the first two columns of the current file, the first column is set to x, the second column is set to y, and fit it to the polynomial, this inverse procedure comes from echarts. This feature also provides native download images for echarts, as well as a way to download them based on canvas. And the user can complete the changes to the online data according to the workbench and generate the polynomial fitting curve required by the user in real time": "多项式回归旨在处理一个csv文件，它的功能是读取当前文件的前两列，第一列设置为x，第二列设置为y，对其进行多项式拟合，此逆合程序来自与于echarts。此功能还提供了echarts的原生下载图像，也提供了根据canvas的下载方式。并且使用者可以根据工作台完成在线数据的更改并实时生成用户所需的多项式拟合曲线",
  "Irreversible Encryption": "不可逆算法",
  "copy targetContent Successfully": "成功复制目标结果",
  "Sucessful operation.": "操作成功",
  "the origin content which is emitted must not be empty": "提交原始内容不能为空",
  "the size of file exceeds the limit": "文本大小超出显示",
  "demo-collapse": "demo-collapse",
  "create-account": "创建用户",
  "similarity":"相似度"
}
